<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
    <string>Downloads Firefox ESR disk image and builds a package.
Some useful values for RELEASE are: 'latest', 'esr-latest', 'beta-latest'.
LOCALE controls the language localization to be downloded.
Examples include 'en-US', 'de', 'sv-SE', and 'zh-TW'
See the following URLs for more info:
    http://ftp.mozilla.org/pub/firefox/releases/latest/README.txt
    http://ftp.mozilla.org/pub/firefox/releases/latest-esr/README.txt
    http://ftp.mozilla.org/pub/firefox/releases/latest-beta/README.txt</string>
	<key>Identifier</key>
	<string>com.github.el2493.pkg.FirefoxESR</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FirefoxESR</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.el2493.download.firefox-esr-en_US</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>MozillaURLProvider</key>
			<dict>
				<key>path</key>
				<string></string>
				<key>sha256_hash</key>
				<string>PROCESSOR FILEPATH NOT FOUND</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.el2493.download.firefox-esr-en_US</key>
			<dict>
				<key>git_hash</key>
				<string>0026877b35588f6a5983fca6876c7a65815d73c7</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.el2493.autopkg/FirefoxESR.download.recipe</string>
				<key>sha256_hash</key>
				<string>7637302a64e6b4a8f9104060726fdd8d7bc479ff547059cef64bcf7b6133e19e</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Firefox.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/Firefox.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>org.mozilla.firefox.pkg</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
