<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent pkg recipe to download latest Mendeley Desktop and import it into the JSS.</string>
	<key>Identifier</key>
	<string>com.github.el2493.jss.MendeleyDesktopFull</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
    		<key>NAME</key>
		<string>Mendeley Desktop</string>
    		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Mendeley is a free reference manager and academic social network. Make your own fully-searchable library in seconds, cite as you write, and read and annotate your PDFs on any device.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>MendeleyDesktop.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.pkg.Mendeley</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.hansen-m.download.Mendeley</key>
			<dict>
				<key>git_hash</key>
				<string>2e51046d9f383f2f39d9aee0aef270c44fe946da</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hansen-m-recipes/Mendeley/Mendeley.download.recipe</string>
				<key>sha256_hash</key>
				<string>8e05be2acc44253eac856953b79e799342f2f46093710f06d7cd1da9a5d403b3</string>
			</dict>
			<key>com.github.hansen-m.pkg.Mendeley</key>
			<dict>
				<key>git_hash</key>
				<string>0b2afcbda19a32b59f349b2d541d3673fb7dbf59</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hansen-m-recipes/Mendeley/Mendeley.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>fc209d5b70e5bd0a71913189d56878313de833a871bf95eb92512bec7f2b951d</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
