<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
    <string>Adapted from rtrouton's openJDK 13 recipe. Downloads the current release version of OpenJDK 16 and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.el2493.pkg.OpenJDK16</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>OpenJDK 16</string>
        <key>VENDOR</key>
        <string>OpenJDK</string>
        <key>SOFTWARETITLE</key>
        <string>Java</string>
        <key>SOFTWARETYPE</key>
        <string>JDK</string>
    </dict>
	<key>ParentRecipe</key>
	<string>com.github.el2493.download.OpenJDK16</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.el2493.download.OpenJDK16</key>
			<dict>
				<key>git_hash</key>
				<string>b2621c2f0000fcb8676ad5381a29c69d5827549f</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.el2493.autopkg/OpenJDK16.download.recipe</string>
				<key>sha256_hash</key>
				<string>34cdd21de4d9d707b52154ebe9ba2f180b77d705c75a49a9657828ec135bae91</string>
			</dict>
		</dict>
	</dict>
	<key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/Scripts</string>
               <key>pkgdirs</key>
               <dict />
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/pkgroot</string>
               <key>pkgdirs</key>
               <dict>
                  <key>Library</key>
                  <string>0755</string>
                  <key>Library/Java</key>
                  <string>0755</string>
                  <key>Library/Java/JavaVirtualMachines</key>
                  <string>0755</string>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
               <key>archive_path</key>
               <string>%pathname%</string>
               <key>destination_path</key>
               <string>%pkgroot%/Library/Java/JavaVirtualMachines</string>
               <key>purge_destination</key>
               <true />
            </dict>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%pkgroot%/Library/Java/JavaVirtualMachines/jdk*/Contents/Info.plist</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%found_filename%</string>
               <key>plist_version_key</key>
               <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
               <key>file_path</key>
               <string>%RECIPE_CACHE_DIR%/Scripts/preinstall</string>
               <key>file_mode</key>
               <string>0755</string>
               <key>file_content</key>
               <string>#!/bin/bash

# Remove existing OpenJDK %version% installation

version_number="%version%"
java_directory="$3/Library/Java/JavaVirtualMachines/jdk-$version_number.jdk"

if [[ -d "$java_directory" ]]; then
  rm -rf "$java_directory"
fi

exit 0</string>
            </dict>
         </dict>

         <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
               <key>pkg_request</key>
               <dict>
                  <key>pkgname</key>
                  <string>%VENDOR%-%version%</string>
                  <key>version</key>
                  <string>%version%</string>
                  <key>id</key>
                  <string>net.java.openjdk</string>
                  <key>scripts</key>
                  <string>Scripts</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>chown</key>
                  <array>
                     <dict>
                        <key>path</key>
                        <string>Library</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                     <dict>
                        <key>path</key>
                        <string>Library/Java</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                     <dict>
                        <key>path</key>
                        <string>Library/Java/JavaVirtualMachines</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>wheel</string>
                     </dict>
                  </array>
               </dict>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                  <string>%RECIPE_CACHE_DIR%/Scripts</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>
