<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent pkg recipe to download latest Zotero and import it into the JSS.</string>
	<key>Identifier</key>
	<string>com.github.el2493.jss.zotero</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
    		<key>GROUP_NAME</key>
		<string>%NAME%-update-lab</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplateCustom.xml</string>
    		<key>NAME</key>
		<string>Zotero</string>
 		<key>POLICY_CATEGORY</key>
		<string>Lab Monthly Updates</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplateLab.xml</string>
		<key>TRIGGER</key>
		<string>lmupdates</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.el2493.pkg.zotero</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.el2493.pkg.zotero</key>
			<dict>
				<key>git_hash</key>
				<string>14c7e01a3bf0d7a50f915791910fdb95daa7e9da</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.el2493.autopkg/Zotero.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>b991698de190adc45f4eb86ae40ff169ff320cb5d3c861c0600b670ed74fa31a</string>
			</dict>
			<key>com.github.joshua-d-miller.download.zotero</key>
			<dict>
				<key>git_hash</key>
				<string>7ffd8d1b5688aceacc2881e8b137b3c6f8438605</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.joshua-d-miller-recipes/Zotero/Zotero.download.recipe</string>
				<key>sha256_hash</key>
				<string>e127f5248c98b22274ad334d5847a7b9ff7a8aee96776b922ac1b816da6a1cc9</string>
			</dict>
		</dict>
	</dict>
  	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
		</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
